Repository: Anne017/indicator-darkmode
Catalog: po/*.po
Languages: de

source: Suru Dark mode Indicator
de: Suru Dark Design Indikator

source: What is this?
de: Was ist das überhaupt?

source: This is a proof of concept for an indicator to switch between Ambiance and Suru Dark theme.
de: Dies ist ein Machbarkeitstest für einen Indikator um zwischen dem Ambiance und dem SuruDark Designs zu wechseln.

source: What does it exactly do?
de: Was genau passiert hier?

source: It modifies the theme in the config file "/home/phablet/.config/ubuntu-ui-toolkit/theme.ini"
de: Es ändert das in der Config-Datei "/home/phablet/.config/ubuntu-ui-toolkit/theme.ini" gespeicherte Design

source: How does it work?
de: Wie funktioniert das?

source: Enabling Dark Mode from the indicator will switch to the theme "Suru Dark".
de: Das aktivieren von Dark Mode im Indikator wechselt zum Design "Suru Dark".

source: Disabling it will revert back to "Ambiance".
de: Deaktivieren wechselt zurück zu "Ambiance".

source: There is also an option to switch the theme automatically based on the time.
de: Es gibt weiterhin eine Option um das Design zeitbasiert zu wechseln.

source: Anything else?
de: Noch etwas?

source: The theme change won't take effect on currently open apps until they are restarted.
de: Das Design wird nicht für momentan geöffnete Apps aktiv, sondern erst wenn diese neu gestartet werden.

source: Time accuracy for automatically switching to a theme will be based on the set time interval for checking the time.
de: Die Zeitgenauigkeit des zeitbasierten Designwechsels hängt vom eingestellten Prüfintervall ab.

source: Impact on battery is still unknown but do let me know if you notice significant reduction of battery.
de: Der Einfluss auf die Akkulaufzeit ist immer noch unbekannt. Bitte gib mir Bescheid wenn du einen starken Verbrauch bemerkst.

source: Some devices such as the Pinephone and Meizu MX4 may have less accurate scheduled switching due to their deep sleep behavior.
de: Einige Geräte wie das Pinephone oder das Meizu MX4 haben eine ungenauere Zeitschaltung wegen ihres Standbyverhaltens.

source: For these devices, it is advised to use lower interval time and just observe the battery.
de: Für diese Geräte wird empfohlen ein kürzeres Zeitintervall einzustellen und die Akkulaufzeit zu beobachten.

source: For other devices such as the Nexus 5, it's fine to set the interval to max 60 minutes and it'll still be accurate.
de: Für andere Geräte wie das Nexus 5 ist die Zeitschaltung auch bei einem Intervall von 60 Minuten immer noch akkurat.

source: Suru Dark theme support varies across apps. There are apps that just works while some will only have partial support and some won't even respect it.
de: Die Implementierung des Suru Dark Designs ist unterschiedlich. Manche Apps klappen gut, manche teilweise und manche unterstützen dieses Design gar nicht.

source: Reinstall the indicator and reboot or restart Lomiri whenever an update is installed.
de: Bei jedem Update müssen der Indikator und anschließend Lomiri neu gestartet werden.

source: Schedule Settings
de: Zeitschaltungseinstellungen

source: Start time
de: Anfangszeit

source: End time
de: Endzeit

source: Time check interval (minutes)
de: Zeitprüfintervall (in Minuten)

source: This determines how often the indicator will check the time and if there's a need to toggle the theme.
de: Dies bestimmt, wie oft der Indikator abgleicht, ob das Design gewechselt werden muss.

source: Warning: Lower value will make the scheduled switching more accurate but may impact the battery.
de: Achtung: Niedrige Werte erhöhen die Genauigkeit der Zeitschaltung aber können die Akkulaufzeit beeinträchtigen.

source: Indicator logging
de: Logaufzeichnung für den Indikator

source: Useful for debugging
de: Nützlich für die Fehlersuche

source: Install Indicator
de: Indikator installieren

source: Uninstall Indicator
de: Indikator deinstallieren

source: Restart Lomiri/Unity8
de: Lomiri/Unity8 neu starten

source: Uninstall the indicator here before uninstalling the app!
de: Vor Deinstallation der App hier den Indikator deinstallieren!

source: Restart Lomiri
de: Lomiri Neustart

source: Do you want to restart Lomiri now?
de: Möchtest du jetzt Lomiri neu starten?

source: All currently open apps will be closed.
de: Alle offenen Apps werden geschlossen.

source: Save all your work before continuing!
de: Speichere alle Arbeiten bevor du fortfährst!

source: Cancel
de: Abbrechen

source: Successfully installed!
de: Erfolgreich installiert!

source: Please reboot or restart Lomiri/Unity8
de: Bitte Gerät oder Lomiri/Unity8 neu starten

source: Failed to install
de: Installation fehlgeschlagen

source: Successfully uninstalled!
de: Erfolgreich deinstalliert!

source: Failed to uninstall
de: Deinstallation fehlgeschlagen

source: Indicator Suru Dark Mode
de: SuruDark Design Indikator

source: Scheduled
de: Zeitschaltung

source: Suru Dark Mode
de: Suru Dark Design

source: Suru Dark Mode Settings...
de: Suru Dark Design Einstellungen...
